
Процедура ПередЗаписью(Отказ)  
	Если ПустаяСтрока(УникальныйИдентификатор) Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = Наименование;
		ПользовательИБ.ПолноеИмя = Наименование;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Базовые);
		ПользовательИБ.Записать();
		
		УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
		                                                                    
	КонецЕсли;
КонецПроцедуры
