 

Процедура ОбработкаПроведения(Отказ, Режим)
		
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СырьеНаСкладахОстатки.Сырье,
		|	СырьеНаСкладахОстатки.Склад,
		|	-СырьеНаСкладахОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.СырьеНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И Сырье В
		|					(ВЫБРАТЬ
		|						РеализацияСырьяТовары.Сырье
		|					ИЗ
		|						Документ.РеализацияСырья.Товары КАК РеализацияСырьяТовары
		|					ГДЕ
		|						РеализацияСырьяТовары.Ссылка = &Ссылка)) КАК СырьеНаСкладахОстатки
		|ГДЕ
		|	СырьеНаСкладахОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		        Сообщить ("Недостаточно сырья "+ВыборкаДетальныеЗаписи.Сырье+" в количестве "+ВыборкаДетальныеЗаписи.Количество);
				
			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;   	
КонецПроцедуры
